---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DuctTerminalEngagementLength
source: html/ef25ea30-a9a5-32d4-d17e-78ed0fe2a911.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DuctTerminalEngagementLength Property

"Engagement Length"

## Syntax (C#)
```csharp
public static ForgeTypeId DuctTerminalEngagementLength { get; }
```